---
kind: property
id: P:Autodesk.Revit.DB.ImageType.PathType
source: html/c50808f3-77e5-9606-ec79-721c03873ed2.htm
---
# Autodesk.Revit.DB.ImageType.PathType Property

The path type that was used to refer to the file from which the ImageType was loaded.

## Syntax (C#)
```csharp
public PathType PathType { get; }
```